import { Container, Row, Col, Image } from "react-bootstrap";
import aboutImage from "../img/costumes/costume1.JPG"; // Замініть на актуальний шлях до зображення

const About = () => {
  return (
    <Container className="mt-4">
      <h2 className="text-center mb-4">Про нас</h2>

      <Row className="align-items-center">
        {/* Колонка для зображення */}
        <Col md={6}>
          <Image
            src={aboutImage}
            alt="Карнавальні костюми"
            fluid
            className="mb-4 mb-md-0"
            style={{
              maxWidth: "70%", // Забезпечуємо, щоб картинка не виходила за межі контейнера
              height: "auto", // Зберігаємо пропорції картинки
              objectFit: "cover", // Запобігаємо спотворенню картинки
              borderRadius: "8px", // Округлі краї для м'якшого вигляду
            }}
          />
        </Col>

        {/* Колонка для тексту */}
        <Col md={6}>
          <p>
            Прокат карнавальних костюмів «Мальвіна» допоможе здійснити всі Ваші
            дитячі мрії та перетворити свято у справжнє казкове диво!​ Кожен
            карнавальний, святковий костюм у майстерні Мальвіни – це оригінальний
            дизайн та ручна робота нашої винахідливої майстрині! Широкий вибір,
            понад 2000 костюмів дозволяє Вашому хлопчику перевтілитись в лицаря
            або космічного рейнджера, супергероя або мушкетера, а дівчинці - стати
            феєю, метеликом або ж справжньою казковою принцесою. Перевтілюючись, Ваша
            дитина зможе творчо проявити себе і бути впевненою у колі друзів! Наші
            костюми допоможуть Вам перевтілитися в будь-який образ і Ваші фотоальбоми
            будуть вражати уяву всіх друзів і родичів.
          </p>
          <p>
            У нас Ви можете знайти карнавальні костюми та святкові плаття на будь-яку
            тематику: 
            <ul>
              <li>новорічні та казкові герої</li>
              <li>тварини і птахи</li>
              <li>сад і город (квіти, овочі, фрукти та ін)</li>
              <li>явища природи, пори року</li>
              <li>сукні до першого причастя</li>
              <li>національні та багато інших</li>
            </ul>
            Також у нас є дорослі костюми для вечірок та вертепу! На сайті виставлена
            лише не велика частина наших костюмів на прокат. Якщо Ви не знайшли
            необхідний костюм - зв’яжіться з нами, ми обов’язково знайдем вихід і
            оригінальне рішення! Ми здійснюєм прокат, продаж та індивідуальне пошиття
            костюмів.​ Майстерня «Мальвіна» бажає Вам яскравих вражень та веселих
            свят!!!
          </p>
        </Col>
      </Row>
    </Container>
  );
};

export default About;
